var poetsInfo = [{
        "name": "LiBai",
        "chiName": "李白",
        "img": "http://www.hwjyw.com/zhwh/traditional_culture/zgwx/gdwx/200712/W020071213534008368140.jpg",
        "intro": "李白（701年－762年） ，字太白，号青莲居士，又号“谪仙人”，是唐代伟大的浪漫主义诗人，被后人誉为“诗仙”"
    }, {
        "name": "DuFu",
        "chiName": "杜甫",
        "img": "https://ss0.bdstatic.com/70cFuHSh_Q1YnxGkpoWK1HF6hhy/it/u=3579140198,216816410&fm=26&gp=0.jpg",
        "intro": "杜甫（712年—770年），字子美，自号少陵野老，唐代伟大的现实主义诗人，与李白合称“李杜”。\
    杜甫在中国古典诗歌中的影响非常深远，被后人称为“诗圣”，他的诗被称为“诗史”。"
    }, {
        "name": "MengHaoRan",
        "chiName": "孟浩然",
        "img": "https://ss3.bdstatic.com/70cFv8Sh_Q1YnxGkpoWK1HF6hhy/it/u=3470644387,3551881596&fm=26&gp=0.jpg",
        "intro": "孟浩然（689年—740年），名浩，字浩然，号孟山人，\
    襄州襄阳（今湖北襄阳）人，唐代著名的山水田园派诗人，世称“孟襄阳”。因他未曾入仕，又称之为“孟山人”。",
    }, {
        "name": "WangWei",
        "chiName": "王维",
        "img": "../images/WangWei.jpg",
        "intro": "王维（701年－761年，一说699年—761年），字摩诘，号摩诘居士。\
    王维参禅悟理，学庄信道，精通诗、书、画、音乐等，以诗名盛于开元、天宝间，尤长五言，多咏山水田园，与孟浩然合称“王孟”，有“诗佛”之称"
    },
    {
        "name": "BaoZheng",
        "chiName": "包拯",
        "img": "../images/BaoZheng.jpg",
        "intro": "包拯（999年－1062年7月3日），字希仁。庐州合肥（今安徽合肥肥东）人。北宋名臣。"
    },
    {
        "name": "CenCan",
        "chiName": "岑参",
        "img": "../images/CenShen.jpg",
        "intro": "岑参（约715年—约770年），荆州江陵（有争议）人，唐代诗人，被誉为边塞派诗人，与高适并称“高岑”。"
    },
    {
        "name": "ChengYi",
        "chiName": "程颐",
        "img": "../images/ChengYi.jpg",
        "intro": "程颐（1033年9月11日—1107年10月5日） [1]  ，字正叔，世居中山，后徙为河南府洛阳（今河南洛阳） 人，\
    世称伊川先生，北宋理学家、教育家。为程颢之胞弟。历官汝州团练推官、西京国子监教授。元祐元年（1086年）除秘书省校书郎，授崇政殿说书。"
    },
    {
        "name": "GaoShi",
        "chiName": "高适",
        "img": "../images/GaoShi.jpg",
        "intro": "高适（704—765年），字达夫，作为著名边塞诗人，高适与岑参并称“高岑”，与岑参、王昌龄、王之涣合称“边塞四诗人”。其诗笔力雄健，气势奔放，洋溢着盛唐时期所特有的奋发进取、蓬勃向上的时代精神。"
    },
    {
        "name": "HanYu",
        "chiName": "韩愈",
        "img": "../images/HanYu.jpg",
        "intro": "韩愈（768年－824年12月25日），字退之，是唐代古文运动的倡导者，被后人尊为“唐宋八大家”之首，与柳宗元并称“韩柳”，有“文章巨公”和“百代文宗”之名。后人将其与柳宗元、欧阳修和苏轼合称“千古文章四大家”。"
    },
    {
        "name": "HuangTingJian",
        "chiName": "黄庭坚",
        "img": "../images/HuangTingJian.jpg",
        "intro": "黄庭坚（1045年8月9日—1105年5月24日），字鲁直，号山谷道人、涪翁，洪州分宁（江西省九江市修水县）人，北宋著名文学家、书法家、江西诗派开山之祖。"
    },
    {
        "name": "JiaDao",
        "chiName": "贾岛",
        "img": "../images/JiaDao.jpg",
        "intro": "贾岛（779～843年），唐代诗人，字阆（读láng）仙，人称“诗奴”，与孟郊共称“郊寒岛瘦”，汉族，唐朝河北道幽州范阳县（今河北省涿州）人。自号“碣石山人”。"
    },
    {
        "name": "KouZhun",
        "chiName": "寇凖",
        "img": "../images/KouZhun.jpg",
        "intro": "寇凖（961年—1023年10月24日），字平仲，华州下邽（今陕西渭南）人。北宋政治家、诗人"
    },
    {
        "name": "LiDeYu",
        "chiName": "李德裕",
        "img": "../images/LiDeYu.jpg",
        "intro": "李德裕（787年—850年），字文饶，小字台郎，赵郡赞皇（今河北赞皇县）人。唐代杰出政治家、文学家、战略家，中书侍郎李吉甫次子。"
    },
    {
        "name": "LiHe",
        "chiName": "李贺",
        "img": "../images/LiHe.jpg",
        "intro": "李贺（约公元790年-约817年），字长吉，是“长吉体诗歌开创者。”唐代河南福昌（今河南洛阳宜阳县）人，家居福昌昌谷，后世称李昌谷，是唐宗室，唐高祖李渊的叔父李亮（大郑王）后裔。有“诗鬼”之称"
    },
    {
        "name": "LingHuChu",
        "chiName": "令狐楚",
        "img": "../images/LingHuChu.jpg",
        "intro": "令狐楚为唐德宗贞元七年（791年）进士。唐宪宗时，擢职方员外郎、知制诰，受皇甫镈推荐，被任命为翰林学士，自此卷入党争。后出为华州刺史，拜河阳节度使。元和十四年（819年），入朝拜相，任中书侍郎、同平章事。宪宗去世，为山陵使，因亲吏赃污事被贬为衡州刺史。唐敬宗继位后，又重新提拔他为户部尚书、东都留守、天平军节度使、吏部尚书，累升至检校尚书右仆射，封彭阳郡公。后以山南西道节度使致仕。开成二年（837年），令狐楚病逝，年七十二。追赠司空，谥号“文”。累赠太尉。"
    }, {
        "name": "LiQingZhao",
        "chiName": "李清照",
        "img": "http://a2.att.hudong.com/51/73/14300000937882128714730585174.jpg",
        "intro": "李清照（1084年3月13日—约1155年），号易安居士，汉族，齐州济南（今山东省济南市章丘区）人。宋代女词人，婉约词派代表，有“千古第一才女”之称。"
    }, {
        "name": "LiuChangQing",
        "chiName": "刘长卿",
        "img": "https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=f1ba93fdb4315c6043956ce9b58aac2e/1c950a7b02087bf41b956801fad3572c10dfcfd8.jpg",
        "intro": "刘长卿(709—789)，字文房，汉族，宣城（今属安徽）人，唐代诗人。后迁居洛阳，河间（今属河北）为其郡望。唐玄宗天宝年间进士。肃宗至德中官监察御史，苏州长洲县尉，代宗大历中任转运使判官，知淮西、鄂岳转运留后，又被诬再贬睦州司马。因刚而犯上，两度迁谪。德宗建中年间，官终随州刺史，世称刘随州。"
    }, {
        "name": "LiuZongYuan",
        "chiName": "柳宗元",
        "img": "https://gss2.bdstatic.com/9fo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=95289497db33c895a67e9f7de92814cd/b3b7d0a20cf431ad51e3a0394936acaf2edd98f9.jpg",
        "intro": "柳宗元（公元773年—公元819年11月28日），字子厚，汉族，河东（现山西运城永济一带）人， [1]  唐宋八大家之一，唐代文学家、哲学家、散文家和思想家世称“柳河东”、 “河东先生”，因官终柳州刺史，又称“柳柳州”。柳宗元与韩愈并称为“韩柳”，与刘禹锡并称“刘柳”，与王维、孟浩然、韦应物并称“王孟韦柳”。"
    }, {
        "name": "LuoBinWang",
        "chiName": "骆宾王",
        "img": "https://gss0.bdstatic.com/94o3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=66e88fddad773912c4268267c022e125/cf1b9d16fdfaaf51633548df885494eef11f7af8.jpg",
        "intro": "骆宾王（约619年—约687年），字观光，婺州义乌（今浙江义乌市）人。唐代著名诗人。出身寒微，少有才名。永徽年间，成为道王李元庆府属，历任武功主簿，迁长安主簿。仪凤三年（678年），入为侍御史，因事下狱，遇赦而出。调露二年（680年），除临海丞，坐事辞官。光宅元年（684年），跟随徐敬业起兵讨伐武则天时，撰写《为徐敬业讨武曌檄》。徐敬业败亡后，下落不明，或说被乱军所杀，或说遁入了空门。"
    }, {
        "name": "LuZhaoLin",
        "chiName": "卢照邻",
        "img": "https://gss2.bdstatic.com/-fo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=0f709ca35766d0167e19992eaf10b33a/5243fbf2b211931386d5e0de60380cd790238dcd.jpg",
        "intro": "卢照邻（约635-约685年），字升之，号幽忧子，幽州范阳（今河北涿州市）人。唐朝时期大臣、著名诗人。出身范阳卢氏，博学能文。起家邓王（李元裕）府典签，迁益州新都县尉，因病辞官。爱好诗歌文学，与王勃、杨炯、骆宾王并为“初唐四杰”。不堪重负，投水自尽。著有《卢升之集》，明朝张燮辑有《幽忧子集》存于世。卢照邻尤工诗歌骈文，以歌行体为佳，佳句传颂不绝，如“得成比目何辞死，愿作鸳鸯不羡仙”等，更被后人誉为经典。"
    }, {
        "name": "MengJiao",
        "chiName": "孟郊",
        "img": "../images/.jpg",
        "intro": "孟郊（751年－814年），字东野，湖州武康（今浙江省德清县）人，祖籍平昌（今山东德州临邑县）。唐代著名诗人。先世居洛阳（今河南洛阳），少时隐居嵩山。孟郊两试进士不第，四十六岁时才中进士，曾任溧阳县尉。由于不能舒展他的抱负，遂放迹林泉间，徘徊赋诗。以至公务多废，县令乃以假尉代之。后因河南尹郑余庆之荐，任职河南，晚年生活多在洛阳度过。唐宪宗元和九年，郑余庆再度招他往兴元府任参军，乃偕妻往赴，行至阌乡县（今河南灵宝），暴疾而卒，葬洛阳东。张籍私谥为”贞曜先生“。孟郊工诗。因其诗作多写世态炎凉，民间苦难，故有“诗囚”之称，与贾岛并称“郊寒岛瘦”。孟诗现存500多首，以短篇五古最多。今传本《孟东野诗集》10卷。"
    }, {
        "name": "NiuSengRu",
        "chiName": "牛僧孺",
        "img": "https://gss0.bdstatic.com/-4o3dSag_xI4khGkpoWK1HF6hhy/baike/s%3D220/sign=d648fbb50ad162d981ee651e21dfa950/242dd42a2834349bd77bdbf4c9ea15ce36d3be46.jpg",
        "intro": "牛僧孺（779年－848年），字思黯，安定鹑觚人，唐朝宰相，牛李党争中牛党领袖。牛僧孺是进士出身。元和四年（公元809年）以贤良方正对策，与李宗闵等共同抨击时政，为宰相李吉甫排斥而久不任用。穆宗时，累官至户部侍郎、同平章事。敬宗时出任武昌军节度使。大和四年（公元830年）任兵部尚书、同平章事，成为牛（僧孺）、李（德裕）之争中牛派首领人物。武宗时，李吉甫之子李德裕为相，牛被贬任循州长史。宣宗时召还，不久病卒。"
    }, {
        "name": "PiRiXiu",
        "chiName": "皮日休",
        "img": "https://gss1.bdstatic.com/-vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=f70b68e849fbfbeddc59317940cb900b/a2cc7cd98d1001e994a5edd8ba0e7bec55e79748.jpg",
        "intro": "皮日休（约公元838年—约公元883年），晚唐文学家。字袭美，一字逸少，汉族，复州竟陵（今湖北天门）人。曾居住在鹿门山，道号鹿门子，又号间气布衣、醉吟先生、醉士等。咸通八年（867）进士及第，在唐时历任苏州军事判官（《吴越备史》）、著作佐郎、太常博士、毗陵副使。后参加黄巢起义，或言“陷巢贼中”（《唐才子传》），任翰林学士，起义失败后不知所踪。皮日休是晚唐著名诗人、文学家，与陆龟蒙齐名，世称“皮陆”。其诗文兼有奇朴二态，且多为同情民间疾苦之作，被鲁迅赞誉为唐末“一塌糊涂的泥塘里的光彩和锋芒”。《新唐书·艺文志》录有《皮日休集》、《皮子》、《皮氏鹿门家钞》多部，对于社会民生有深刻的洞察和思考。"
    }, {
        "name": "QianQi",
        "chiName": "钱起",
        "img": "https://gss1.bdstatic.com/-vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=0d9d6d82e424b899de3c7e3e563d7aa8/0823dd54564e9258f4acc16c9182d158cdbf4e93.jpg",
        "intro": "钱起（722？—780年），字仲文，汉族，吴兴（今浙江湖州市）人，唐代诗人。大书法家怀素和尚之叔。早年数次赴试落第，唐天宝十年（751年）进士。初为秘书省校书郎、蓝田县尉，后任司勋员外郎、考功郎中、翰林学士等。曾任考功郎中，故世称“钱考功”。代宗大历中为翰林学士。他是“大历十才子”之一，也是其中杰出者，被誉为“大历十才子之冠”。又与郎士元齐名，称“钱郎”，当时称为“前有沈宋，后有钱郎。”"
    }, {
        "name": "QingGuan",
        "chiName": "秦观",
        "img": "https://gss0.bdstatic.com/-4o3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=b1083408dcc8a786be2a4d085f32ae00/730e0cf3d7ca7bcb9e5153ddb3096b63f624a81e.jpg",
        "intro": "秦观（1049年—1100年9月17日），江苏省高邮市人，字少游，一字太虚，别号邗沟居士，学者称其淮海居士。苏轼曾戏呼其为“山抹微云君”，北宋婉约词人。官至太学博士、国史馆编修。一生坎坷，所写诗词，高古沉重，寄托身世，感人至深。他长于议论，文丽思深，兼有诗、词、文赋和书法多方面的艺术才能，尤以婉约之词驰名于世。著有《淮海集》40卷、《淮海词》（又名《淮海居士长短句》）3卷、《劝善录》、《逆旅集》等。为“苏门四学士”、“苏门六君子”之一。秦观是北宋文学史上的一位重要作家，被尊为婉约派一代词宗。但在秦观现存的所有作品中，词只有三卷100多首，而诗有十四卷430多首，文则达三十卷共250多篇，诗文相加，其篇幅远远超过词若干倍。"
    }, {
        "name": "QuanDeYu",
        "chiName": "权德舆",
        "img": "https://gss2.bdstatic.com/-fo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=c1aaae2a8235e5dd902ca2d94efdc0d2/377adab44aed2e7305bcc8548001a18b87d6fa75.jpg",
        "intro": "权德舆（759年—818年）， 字载之，天水略阳（今甘肃秦安东北）人，后徙润州丹徒（今江苏镇江）。唐朝文学家、宰相，起居舍人权皋之子。少有才气，未冠时即以文章称，杜佑、裴胄交辟之。唐德宗闻其材，召为太常博士，改左补阙，兼制诰，进中书舍人，历礼部侍郎，三次知贡举。唐宪宗时，累迁礼部尚书、同平章事。后坐事罢相，历任东都留守东都。复拜太常卿，徙刑部尚书，出为山南西道节度使。元和十三年（818年）去世，年六十。追赠左仆射，谥号“文”。权德舆掌诰九年，三知贡举，位历卿相，在贞元，元和年间名重一时。"
    }, {
        "name": "SongXiang",
        "chiName": "宋庠",
        "img": "https://gss3.bdstatic.com/7Po3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=e64266713fc79f3d8fe1e336829aaa2c/6a63f6246b600c33a83bfd461e4c510fd8f9a1f9.jpg",
        "intro": "宋庠（xiáng）（996年—1066年），初名郊，字伯庠，入仕后改名庠，更字公序。北宋文学家，工部尚书宋祁之兄。开封府雍丘县双塔乡（今河南商丘民权县双塔乡）人。\
        北宋天圣二年（1024年），宋庠状元及第，成为“连中三元”（乡试、会试、殿试均第一）之人。官至兵部侍郎、同平章事，以司空、郑国公致仕。治平三年（1066年），宋庠去世，年七十一。追赠太尉兼侍中，谥号“元献”（一作元宪），英宗亲题其碑首为“忠规德范之碑”。\
        宋庠与弟宋祁并有文名，时称“二宋”。诗多秾丽之作，著有《宋元宪集》、《国语补音》等。"
    }, {
        "name": "WangZhi",
        "chiName": "王质",
        "img": "https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=261e4abb41a7d933bfa8e3759570b62e/5882b2b7d0a20cf418008e7075094b36adaf9988.jpg",
        "intro": "王质（1127年——1189年），字景文，号雪山，郓州（今山东东平）人，寓居兴国军（今湖北阳新县）。南宋高宗、孝宗时期著名经学家、诗人、文学家。"
    }, {
        "name": "SongZhiWen",
        "chiName": "宋之问",
        "img": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562174938&di=15d2abc981c06763f4efee36fea254eb&imgtype=jpg&er=1&src=http%3A%2F%2F5b0988e595225.cdn.sohucs.com%2Fimages%2F20171117%2F8cb6d1e507214a3ea38e8c7f0725017c.jpeg",
        "intro": "宋之问，字延清，汉族，汾州（今山西汾阳市）人，初唐时期的著名诗人。宋之问年轻时即已知名，“尤善五言诗，其时无能出其右者。”从《宋之问集》和《全唐诗》所收作品来看，他对当时体裁多能把握，运用熟谙，佳作名句也有可观。宋之问为文赋诗，讲求比兴，属对精密，点划入微，对诗的声律化有重大贡献。他与沈佺期在齐、梁沈放、庾信到初唐四杰创作发展的基础上，努力加以实践和总结，使律诗各体制都达到了成熟定型的地步，明确划开了古体诗和近体诗的界限，并运用这种形式，写出了优秀的作品，如《江亭晚望》、《晚泊湘江》、《题大庾岭北驿》、《度大庾岭》等。"
    }, {
        "name": "SuShi",
        "chiName": "苏轼",
        "img": "https://ss3.bdstatic.com/70cFv8Sh_Q1YnxGkpoWK1HF6hhy/it/u=404728090,3009230519&fm=26&gp=0.jpg",
        "intro": "苏轼（1037年1月8日，一说1036年12月19日—1101年8月24日），字子瞻、和仲，号铁冠道人、东坡居士，世称苏东坡、苏仙，汉族，眉州眉山（四川省眉山市）人，祖籍河北栾城，北宋著名文学家、书法家、画家。嘉祐二年（1057），苏轼进士及第。宋神宗时在凤翔、杭州、密州、徐州、湖州等地任职。元丰三年（1080），因“乌台诗案”被贬为黄州团练副使。宋哲宗即位后任翰林学士、侍读学士、礼部尚书等职，并出知杭州、颍州、扬州、定州等地，晚年因新党执政被贬惠州、儋州。宋徽宗时获大赦北还，途中于常州病逝。宋高宗时追赠太师，谥号“文忠”。"
    }, {
        "name": "SuXun",
        "chiName": "苏洵",
        "img": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562175331&di=d2e124c4c35a0b058b1d27598a58e550&imgtype=jpg&er=1&src=http%3A%2F%2Fwww.shufaai.com%2Fupload%2Fallimg%2F140111%2F1_140111141853_1.jpg",
        "intro": "苏洵（1009年5月22日—1066年5月21日），字明允，自号老泉，汉族，眉州眉山（今属四川眉山）人。北宋文学家，与其子苏轼、苏辙并以文学著称于世，世称“三苏”，均被列入“唐宋八大家”。苏洵擅长于散文，尤其擅长政论，议论明畅，笔势雄健，著有《嘉祐集》二十卷，及《谥法》三卷，均与《宋史本传》并传于世。"
    }, {
        "name": "SuZhe",
        "chiName": "苏辙",
        "img": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1561580759032&di=b033be80b0b09abbc610edde8abe6877&imgtype=0&src=http%3A%2F%2Ffile.digitaling.com%2FeImg%2Fuimages%2F20160613%2F1465807937441995.jpg",
        "intro": "苏辙（1039年3月18日－1112年10月25日），字子由，一字同叔，晚号颍滨遗老。眉州眉山（今属四川）人。北宋文学家、宰相，“唐宋八大家”之一。嘉祐二年（1057年），苏辙登进士第，初授试秘书省校书郎、商州军事推官。宋神宗时，因反对王安石变法，出为河南留守推官。此后随张方平、文彦博等人历职地方。宋哲宗即位后，入朝历官右司谏、御史中丞、尚书右丞、门下侍郎等职，因上书谏事而被落职知汝州，此后连贬数处。宰相蔡京掌权时，再降朝请大夫，遂以太中大夫致仕，筑室于许州。政和二年（1112年），苏辙去世，年七十四，追复端明殿学士、宣奉大夫。宋高宗时累赠太师、魏国公，宋孝宗时追谥“文定”。"
    }, {
        "name": "WangBo",
        "chiName": "王勃",
        "img": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1561580852556&di=e876e07b9fdb18f848328896b95b0abd&imgtype=0&src=http%3A%2F%2Fxx.taozhi.cn%2F_Upload%2FCKFiles%2Fimages%2F20140406102248132.jpg",
        "intro": "王勃（约650年—约676年），字子安，汉族，唐代文学家。古绛州龙门（今山西河津）人，出身儒学世家，与杨炯、卢照邻、骆宾王并称为“王杨卢骆”、“初唐四杰”。王勃自幼聪敏好学，据《旧唐书》记载，他六岁即能写文章，文笔流畅，被赞为“神童”。九岁时，读颜师古注《汉书》，作《指瑕》十卷以纠正其错。十六岁时，应幽素科试及第，授职朝散郎。因做《斗鸡檄》被赶出沛王府。之后，王勃历时三年游览巴蜀山川景物，创作了大量诗文。返回长安后，求补得虢州参军。在参军任上，因私杀官奴二次被贬。唐高宗上元三年（676年）八月，自交趾探望父亲返回时，不幸渡海溺水，惊悸而死。王勃在诗歌体裁上擅长五律和五绝，代表作品有《送杜少府之任蜀州》等；主要文学成就是骈文，无论是数量还是质量，堪称一时之最，代表作品有《滕王阁序》等。"
    }, {
        "name": "WangChangLing",
        "chiName": "王昌龄",
        "img": "https://ss3.bdstatic.com/70cFv8Sh_Q1YnxGkpoWK1HF6hhy/it/u=3965688833,142827214&fm=26&gp=0.jpg",
        "intro": "王昌龄 （698—757），字少伯，汉族，河东晋阳（今山西太原）人，又一说京兆长安人（今西安）人。盛唐著名边塞诗人。王昌龄早年贫苦，主要依靠农耕维持生活，30岁左右进士及第。初任秘书省校书郎，而后又担任博学宏辞、汜水尉，因事被贬岭南。开元末返长安，改授江宁丞。被谤谪龙标尉。安史乱起，被刺史闾丘晓所杀。王昌龄与李白、高适、王维、王之涣、岑参等人交往深厚。其诗以七绝见长，尤以登第之前赴西北边塞所作边塞诗最著，有“诗家夫子王江宁”之誉，又被后人誉为“七绝圣手”。王昌龄诗绪密而思清，与高适、王之涣齐名，时谓王江宁。有文集六卷，今编诗四卷。"
    }, {
        "name": "WangJi",
        "chiName": "王绩",
        "img": "https://ss1.bdstatic.com/70cFuXSh_Q1YnxGkpoWK1HF6hhy/it/u=1902110086,4142806295&fm=26&gp=0.jpg",
        "intro": "王绩（约589—644），字无功，号东皋子，绛州龙门县（山西万荣县通化镇，通化镇1972年由河津县划入万荣县）人，隋朝教育家王通（号文中子）之弟，初唐诗人。隋末举孝廉，除秘书正字。不乐在朝，辞疾，复授扬州六合丞。时天下大乱，弃官还乡。唐武德中，诏以前朝官待诏门下省。贞观初，以疾罢归河渚间，躬耕东皋山（今宿州五柳风景区），自号“东皋子”。性简傲，嗜酒，能饮五斗，自作《五斗先生传》 ，撰 《酒经》 、《酒谱》 ，注有“老”、“庄”。其诗近而不浅，质而不俗，真率疏放，有旷怀高致，直追魏晋高风。律体滥觞于六朝，而成型于隋唐之际，无功实为先声。"
    }, {
        "name": "WangWei",
        "chiName": "王维",
        "img": "https://ss0.bdstatic.com/70cFvHSh_Q1YnxGkpoWK1HF6hhy/it/u=1984064131,3953965947&fm=26&gp=0.jpg",
        "intro": "王维（701年－761年，一说699年—761年），字摩诘，号摩诘居士。河东蒲州（今山西运城）人，祖籍山西祁县。唐朝著名诗人、画家。王维出身河东王氏，于开元十九年（731年）状元及第。历官右拾遗、监察御史、河西节度使判官。唐玄宗天宝年间，王维拜吏部郎中、给事中。安禄山攻陷长安时，王维被迫受伪职。长安收复后，被责授太子中允。唐肃宗乾元年间任尚书右丞，故世称“王右丞”。王维参禅悟理，学庄信道，精通诗、书、画、音乐等，以诗名盛于开元、天宝间，尤长五言，多咏山水田园，与孟浩然合称“王孟”，有“诗佛”之称。书画特臻其妙，后人推其为南宗山水画之祖。苏轼评价其：“味摩诘之诗，诗中有画；观摩诘之画，画中有诗。”存诗400余首，代表诗作有《相思》、《山居秋暝》等。著作有《王右丞集》、《画学秘诀》。"
    }, {
        "name": "WeiYingWu",
        "chiName": "韦应物",
        "img": "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562176204&di=02adff5ffdbbd94bc018de3926c29b67&imgtype=jpg&er=1&src=http%3A%2F%2Fimg1.gtimg.com%2Frushidao%2Fpics%2Fhv1%2F114%2F151%2F1911%2F124301394.jpg",
        "intro": "韦应物（737～792），中国唐代诗人，汉族，长安(今陕西西安)人。文昌右相韦待价曾孙，出身京兆韦氏逍遥公房。今传有10卷本《韦江州集》、两卷本《韦苏州诗集》、10卷本《韦苏州集》。散文仅存一篇。因出任过苏州刺史，世称“韦苏州”。诗风恬淡高远，以善于写景和描写隐逸生活著称。"
    }, {
        "name": "WeiZheng",
        "chiName": "魏征",
        "img": "http://a3.att.hudong.com/20/29/19300534032170134104297673241.jpg",
        "intro": "魏徵，现作“魏征”（北周大象二年（580年）－唐贞观十七年（643年2月11日）），字玄成，祖籍巨鹿郡下曲阳县（现晋州市） 。隋唐政治家、思想家、文学家和史学家，因直言进谏，辅佐唐太宗共同创建“贞观之治”的大业，被后人称为“一代名相”。官至光禄大夫，封郑国公，谥号“文贞”。《群书治要》总编、《隋书》序论，《梁书》、《陈书》、《齐书》的总论等。其言论多见《贞观政要》。其中最著名，并流传下来的谏文表---《谏太宗十思疏》。"
    }, {
        "name": "WenTianXiang",
        "chiName": "文天祥",
        "img": "http://i0.sinaimg.cn/book/2011/0808/U5083P112DT20110808171723.jpg",
        "intro": "文天祥（1236年6月6日-1283年1月9日），初名云孙，字宋瑞，又字履善。道号浮休道人、文山。江西吉州庐陵（今江西省吉安市青原区富田镇）人，南宋末政治家、文学家，爱国诗人，抗元名臣、民族英雄，与陆秀夫、张世杰并称为“宋末三杰”。"
    }, {
        "name": "XiaoYingShi",
        "chiName": "萧颖士",
        "img": "http://a1.att.hudong.com/16/79/01200000193732136323798993144.jpg",
        "intro": "萧颖士（717年—768年），字茂挺，号文元先生，颍州汝阴（今安徽阜阳市）人。唐朝文学家、名士。作为南朝梁宗室后代，郡望南兰陵（今江苏常州市）。开元二十三年，状元及第，授秘书省正字。高才博学，工于书法，长于古籀文体，时人论其“殷、颜、柳、陆，李、萧、邵、赵，以能全其交也”。工古文辞，语言朴实；诗多清凄之言。家富藏书。"
    }, {
        "name": "XinQiJi",
        "chiName": "辛弃疾",
        "img": "http://a0.att.hudong.com/81/84/19300500337403133333849690778_950.jpg",
        "intro": "辛弃疾（1140年5月28日－1207年10月3日），原字坦夫，后改字幼安，号稼轩 [1]  ，山东东路济南府历城县（今济南市历城区遥墙镇四凤闸村）人。南宋豪放派词人、将领，有“词中之龙”之称。与苏轼合称“苏辛”，与李清照并称“济南二安”。"
    }, {
        "name": "YangJiong",
        "chiName": "杨炯",
        "img": "pic.baike.soso.com/ugc/baikepic2/12436/cut-20180127073453-112015615_jpg_140_187_5951.jpg/300",
        "intro": "杨炯（约650—约693年），华州华阴（今陕西华阴市）人。唐朝大臣、文学家，常山郡公杨初曾孙。文学才华出众，善写散文，尤擅唐诗，与王勃、卢照邻、骆宾王并称“初唐四杰”。"
    }, {
        "name": "YangWanLi",
        "chiName": "杨万里",
        "img": "http://img.zuimeici.com/uploads/1601/1-160112003210448-lp.jpg",
        "intro": "杨万里（1127年10月29日－1206年6月15日），字廷秀，号诚斋。吉州吉水（今江西省吉水县黄桥镇湴塘村）人。南宋著名诗人、大臣，与陆游、尤袤、范成大并称为“中兴四大诗人”。因宋光宗曾为其亲书“诚斋”二字，故学者称其为“诚斋先生”。"
    }, {
        "name": "YaoHe",
        "chiName": "姚合",
        "img": "http://media.zhongguoshici.com/logos/919b2305c7838983d0e4c421ca23b55a",
        "intro": "姚合（约公元779～约公元855），唐代著名诗人。姚合在当时诗名很盛，交游甚广，与刘禹锡、李绅、张籍、王建、杨巨源、马戴、李群玉等都有往来唱酬。与贾岛友善，诗亦相近，然较贾岛略为平浅。世称“姚贾”。"
    }, {
        "name": "ZengGongLiang",
        "chiName": "曾公亮",
        "img": "https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/c0%3Dbaike80%2C5%2C5%2C80%2C26/sign=96c400c78526cffc7d27b7e0d86821f5/64380cd7912397dd80c5ee5a5e82b2b7d0a2872b.jpg",
        "intro": "曾公亮（999年－1078年2月27日），字明仲，号乐正。泉州晋江县（今福建省泉州市）人 。北宋政治家、文学家，刑部郎中曾会次子。曾公亮端庄忠厚深沉，办事细致周密，平时谨守礼仪，遵守规矩，但性情吝啬，积累财富达巨万，神宗曾经将他比作西汉名臣张安世。"
    }, {
        "name": "ZhangChe",
        "chiName": "张彻",
        "img": "http://pic26.nipic.com/20121217/2562635_174353134123_2.jpg",
        "intro": "张彻（?～821），字华耀，清河人，世居南雄保昌县沙水村，排行大，生一子名兴。彻尝从韩愈学，曾与张籍、孟郊三君子联句赋诗；韩愈嘉许其才，以堂侄女妻之。"
    }, {
        "name": "ZhouHe",
        "chiName": "周贺",
        "img": "https://image.gushimi.org/file/ee8233b1435c013283aeb46ae2da75c6.jpg",
        "intro": "周贺，生卒年均不详，约唐穆宗长庆元年前后在世。初居庐山为浮屠，名清塞。后客南徐，又来少室、终南间。工近体诗，格调清雅，与贾岛、无可齐名。"
    }

]

for (var i = 0; i < poetsInfo.length; i++) {
    if (poetsInfo[i]["name"] == poetName) {
        document.getElementById("chiName").innerHTML = poetsInfo[i]["chiName"];
        document.getElementById("poetImg").src = poetsInfo[i]["img"];
        document.getElementById("poetIntro").innerHTML = poetsInfo[i]["intro"];
    }
}