/*var poetInfoArr = ["江油《晚晴》","平武《赠江油尉厅》","江油《访戴天山道士不遇》","重庆《上李邕》",
"峨眉山《峨眉山月歌》","巫山 《宿巫山下》","宜昌 《渡荆门送别》","江陵 《古风》","九江 《登庐山瀑布》其二",
"当涂 《过天门山》","南京 《长干行》","嵊州 《采莲曲》","扬州 《淮南卧病书怀寄蜀中赵徵君蕤》","安陆 《静夜思》",
"武汉《黄鹤楼送孟浩然之广陵》","安陆《长相思三首》其一","西安 《感遇四首》其二","彬县《赠新平少年》",
"西安《蜀道难》","荥阳《登广武古战场怀古》","洛阳 《行路难三首》其一","安陆 《待酒不至》",
"武汉《送张舍人之江东》","登封 《将进酒》","襄阳 《赠孟浩然》","南阳《送友人》","淮安《淮阴书怀寄王宗成》",
"苏州 《送曲十少府》","武汉 《送阳山人归天台》","定陶 《忆襄阳旧游赠马少府巨》","济宁 《客中行》",
"济宁 《别鲁颂》","曲阜 《南陵别儿童入京》","杞县 《秋猎孟诸夜归置酒单父东楼观妓》","济宁《怀仙歌》",
"兖州《送范山人归泰山》","商丘 《对雪献从兄虞城宰》","天台 《古风》其三","庐江 《口号吴王美人半醉》",
"南京《闻王昌龄左迁龙标遥有此寄》","叶县 《古风》其三十四","永年 《赠临洺县令皓弟》","宣城 《赠从弟宣州长史昭》",
"扬州 《哭晁卿衡》","泾县 《赠汪伦》","宣城《寄当涂赵少府炎》","杭州《赠友人三首》",
"宿松 《上皇西巡南京歌十首》","奉节《早发白帝城》","九江 《庐山谣寄卢侍御虚舟》","宜兴《赠从孙义兴宰铭》",
"当涂《游谢氏山亭》"*/

var poetInfoArr = ["《晚晴》","《赠江油尉厅》","《访戴天山道士不遇》","《上李邕》",
"《峨眉山月歌》"," 《宿巫山下》","《渡荆门送别》","《古风》"," 《登庐山瀑布》其二",
"《过天门山》","《长干行》","《采莲曲》","《淮南卧病书怀寄蜀中赵徵君蕤》","《静夜思》",
"《黄鹤楼送孟浩然之广陵》","《长相思三首》其一","《感遇四首》其二","《赠新平少年》",
"《蜀道难》","《登广武古战场怀古》","《行路难三首》其一"," 《待酒不至》",
"《送张舍人之江东》","《将进酒》","《赠孟浩然》","《送友人》","《淮阴书怀寄王宗成》",
" 《送曲十少府》","《送阳山人归天台》","《忆襄阳旧游赠马少府巨》","《客中行》",
"《别鲁颂》","《南陵别儿童入京》"," 《秋猎孟诸夜归置酒单父东楼观妓》","《怀仙歌》",
"《送范山人归泰山》","《对雪献从兄虞城宰》","《古风》其三","《口号吴王美人半醉》",
"《闻王昌龄左迁龙标遥有此寄》"," 《古风》其三十四"," 《赠临洺县令皓弟》","《赠从弟宣州长史昭》",
"《哭晁卿衡》"," 《赠汪伦》","《寄当涂赵少府炎》","《赠友人三首》",
"《上皇西巡南京歌十首》","《早发白帝城》","《庐山谣寄卢侍御虚舟》","《赠从孙义兴宰铭》",
"《游谢氏山亭》"

];
var poetArr = ["野凉疏雨歇，春色遍萋萋","野燕巢官舍，溪云入古厅","野竹分青霭，飞泉挂碧峰",
"大鹏一日同风起，抟摇直上九万里","峨眉山月半轮秋，影入平羌江水流","桃花飞绿水，三月下瞿塘",
"渡远荆门外，来从楚国游<br/>山随平野尽，江入大荒流","北溟有巨鱼，身长数千里<br/>仰喷三山雪，横吞百川水",
"飞流直下三千尺，疑是银河落九天","天门中断楚江开,碧水东流至此回",
"妾发初覆额，折花门前剧<br/>郎骑竹马来，绕床弄青梅","若耶溪边采莲女，笑隔荷花共人语",
"吴会一浮云，飘如远行客","床前明月光，疑是地上霜。<br/>举头望明月，低头思故乡",
"故人西辞黄鹤楼，烟花三月下扬州","日色已尽花含烟，月明欲素愁不眠","虽言异兰蕙，亦自有芳菲",
"何时腾风云，搏击申所能","噫吁戏，危乎高哉，蜀道之难难于上青天！",
"秦鹿奔野草，逐之若飞蓬<br/>项王气盖世，紫电明双瞳","长风破浪会有时，直挂云帆济沧海","山花向我笑，正好衔杯时",
"白日行欲暮，沧波杳难期","君不见黄河之水天上来，奔流到海不复回","吾爱孟夫子，风流天下闻",
"浮云游子意，落日故人情","有德必报之，千金耻为轻","碧云敛海色，流水折江心","涛落浙江秋，沙明浦阳月",
"归心结远梦，落日悬春愁","兰陵美酒郁金香，玉碗盛来琥珀光","独立天地间，清风洒兰雪",
"仰天大笑出门去，我辈岂是蓬蒿人","倾晖速短炬，走海无停川","尧舜之事不足惊，自馀嚣嚣直可轻",
"鲁客抱白鹤，别余往泰山","庭前看玉树，肠断忆连枝","秦皇扫六合，虎视何雄哉","风动荷花水殿香，姑苏台上宴吴王",
"我寄愁心与明月，随风直到夜郎西","天地皆得一，澹然四海清","陶令去彭泽，茫然太古心","长川豁中流，千里泻吴会",
"日本晁卿辞帝都，征帆一片绕蓬壶","桃花潭水深千尺，不及汪伦送我情","相思不可见，回首故人情","兰生不当户，别是闲庭草",
"剑壁门高五千尺，石为楼阁九天开","朝辞白帝彩云间，千里江陵一日还","我本楚狂人，风歌笑孔丘","朗然清秋月，独出映吴台",
"醉罢弄归月，遥欣稚子迎"
];
var lineCountArr = [1,2,5,7,9,12,13,14,16,17,18,19,20,24,24,27,29,31,33,36,38,41,43,47,50,53,
57,61,64,68,69,71,75,80,86,
93,96,103,106,107,114,120,128,131,135,138,144,151,158,165,169,173
];

for (var i = 0; i <lineCountArr.length ; i++) { 
    (function(i) {   //使用闭包，避免执行完循环后i值改变使得呈现诗句错误
     setTimeout(function() { 
        document.getElementById("poetInfo").innerHTML = poetInfoArr[i];
        document.getElementById("poet").innerHTML = poetArr[i];
     }, lineCountArr[i]*4000); 
    })(i); 
   } 

  
 





